l = [
        {
            'title':'手机/运营商/数码',
            'contents':[
                ['电子书刊','电子书','网络原创','数字杂志','多媒体图书'],
                ['音像', '音乐', '影视', '教育音像'],
                ['英文原版', '少儿', '商务投资', '英语学习考试', '文学', '传记'],
                ['文艺', '小说', '文学', '青春文学', '传记', '艺术'],
                ['少儿', '胎教', '0-2岁', '3-6岁', '7-10岁', '11-14岁'],
                ['人文社科', '历史', '哲学', '国学', '政治/军事', '法律', '心理学', '文化', '社会科学'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
                ['教育', '中小学教辅', '教育与考试', '外语学习', '大中专教材', '科学与自然', '字典词典'],
                ['艺术收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'电脑/办公',
            'contents':[
                ['英文原版', '少儿', '商务投资', '英语学习考试', '文学', '传记'],
                ['文艺', '小说', '文学', '青春文学', '传记', '艺术'],
                ['少儿', '胎教', '0-2岁', '3-6岁', '7-10岁', '11-14岁'],
                ['人文社科', '历史', '哲学', '国学', '政治/军事', '法律', '心理学', '文化', '社会科学'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
            ]
        },
        {
            'title':'家具/家居/家装/厨具',
            'contents':[
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
                ['教育', '中小学教辅', '教育与考试', '外语学习', '大中专教材', '科学与自然', '字典词典'],
                ['艺术收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'男装/女装/童装/内衣',
            'contents':[
                ['电子书刊','电子书','网络原创','数字杂志','多媒体图书'],
                ['音像', '音乐', '影视', '教育音像'],
                ['人文社科', '历史', '哲学', '国学', '政治/军事', '法律', '心理学', '文化', '社会科学'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
            ]
        },
        {
            'title':'美妆/个护清洁/宠物',
            'contents':[
                ['电子书刊','电子书','网络原创','数字杂志','多媒体图书'],
                ['文艺', '小说', '文学', '青春文学', '传记', '艺术'],
                ['少儿', '胎教', '0-2岁', '3-6岁', '7-10岁', '11-14岁'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
                ['教育', '中小学教辅', '教育与考试', '外语学习', '大中专教材', '科学与自然', '字典词典'],
                ['艺术收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'女鞋/箱包/钟表/珠宝',
            'contents':[
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
                ['教育', '中小学教辅', '教育与考试', '外语学习', '大中专教材', '科学与自然', '字典词典'],
                ['艺术收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'男鞋/运动/户外',
            'contents':[
                ['英文原版', '少儿', '商务投资', '英语学习考试', '文学', '传记'],
                ['文艺', '小说', '文学', '青春文学', '传记', '艺术'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
                ['教育', '中小学教辅', '教育与考试', '外语学习', '大中专教材', '科学与自然', '字典词典'],
                ['艺术收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'房产/汽车/汽车用品',
            'contents':[
                ['电子书刊','电子书','网络原创','数字杂志','多媒体图书'],
                ['音像', '音乐', '影视', '教育音像'],
                ['英文原版', '少儿', '商务投资', '英语学习考试', '文学', '传记'],
                ['文艺', '小说', '文学', '青春文学', '传记', '艺术'],
                ['少儿', '胎教', '0-2岁', '3-6岁', '7-10岁', '11-14岁'],
                ['人文社科', '历史', '哲学', '国学', '政治/军事', '法律', '心理学', '文化', '社会科学'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'母婴/玩具/乐器',
            'contents':[
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
                ['教育', '中小学教辅', '教育与考试', '外语学习', '大中专教材', '科学与自然', '字典词典'],
                ['艺术收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'食品/酒类/生鲜/特产',
            'contents':[
                ['电子书刊','电子书','网络原创','数字杂志','多媒体图书'],
                ['少儿', '胎教', '0-2岁', '3-6岁', '7-10岁', '11-14岁'],
                ['人文社科', '历史', '哲学', '国学', '政治/军事', '法律', '心理学', '文化', '社会科学'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
                ['教育', '中小学教辅', '教育与考试', '外语学习', '大中专教材', '科学与自然', '字典词典'],
                ['艺术与收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'艺术/礼品鲜花/农资绿箱',
            'contents':[
                ['少儿', '胎教', '0-2岁', '3-6岁', '7-10岁', '11-14岁'],
                ['人文社科', '历史', '哲学', '国学', '政治/军事', '法律', '心理学', '文化', '社会科学'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['艺术收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'医药保健/计生情趣',
            'contents':[
                ['音像', '音乐', '影视', '教育音像'],
                ['英文原版', '少儿', '商务投资', '英语学习考试', '文学', '传记'],
                ['人文社科', '历史', '哲学', '国学', '政治/军事', '法律', '心理学', '文化', '社会科学'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['艺术收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
        {
            'title':'图书/文娱/教育/电子书',
            'contents':[
                ['英文原版', '少儿', '商务投资', '英语学习考试', '文学', '传记'],
                ['文艺', '小说', '文学', '青春文学', '传记', '艺术'],
                ['少儿', '胎教', '0-2岁', '3-6岁', '7-10岁', '11-14岁'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
            ]
        },
        {
            'title':'机票/酒店/旅游/生活',
            'contents':[
                ['电子书刊','电子书','网络原创','数字杂志','多媒体图书'],
                ['文艺', '小说', '文学', '青春文学', '传记', '艺术'],
                ['少儿', '胎教', '0-2岁', '3-6岁', '7-10岁', '11-14岁'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['教育', '中小学教辅', '教育与考试', '外语学习', '大中专教材', '科学与自然', '字典词典'],
                ['艺术收藏', '经济管理', '文化与艺术'],
            ]
        },
        {
            'title':'众筹/白条/保险/企业金融',
            'contents':[
                ['英文原版', '少儿', '商务投资', '英语学习考试', '文学', '传记'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['科技', '工业技术', '金科普读物', '建筑', '医学', '科学与自然', '计算机与互联网'],
            ]
        },
        {
            'title':'安装/维修/清洗/二手',
            'contents':[
                ['英文原版', '少儿', '商务投资', '英语学习考试', '文学', '传记'],
                ['文艺', '小说', '文学', '青春文学', '传记', '艺术'],
                ['人文社科', '历史', '哲学', '国学', '政治/军事', '法律', '心理学', '文化', '社会科学'],
                ['经管励志', '经济', '金融与投资', '管理', '励志与成功'],
                ['生活', '健康与保健', '家庭与育儿', '旅游', '励志与成功'],
                ['教育', '中小学教辅', '教育与考试', '外语学习', '大中专教材', '科学与自然', '字典词典'],
                ['艺术收藏', '经济管理', '文化与艺术'],
                ['其他', '工具书', '杂志期刊', '套装书', '打折图书']
            ]
        },
    ]

TypeNavDic = {'data': []}
for indexi,i in enumerate(l,start = 1):
    # 一级
    t1 = i['title']
    dic1 = {
        'categoryName': t1,
        'categoryId': indexi,
        'categoryChild': []
    }

    # 二级
    for indexj,j in enumerate(i['contents'], start = 1):
        dic2 = {
            'categoryName': j[0],
            'categoryId': indexj,
            'categoryChild': []
        }

        # 三级
        for indexk,k in enumerate(j[1:], start = 1):
            dic3 = {
                'categoryName': k,
                'categoryId': indexk
            }
            dic2['categoryChild'].append(dic3)
        dic1['categoryChild'].append(dic2)
    TypeNavDic['data'].append(dic1)

    

banner = {
    'data': [
        {
            "id": "101",
            "imgUrl": "/images/banner1.jpg"
        },
        {
            "id": "201",
            "imgUrl": "/images/banner2.jpg"
        },
        {
            "id": "301",
            "imgUrl": "/images/banner3.jpg"
        }
    ]
}


floor_ = {
    'data':  [
        {
            "id": "001",
            "name": "豪哥牌洗衣机",
            "keywords": [
                "滚筒洗衣机",
                "鲁班挨揍",
                "1126很帅",
                "1126很漂亮",
                "滚筒洗衣机",
                "电热水器"
            ],
            "imgUrl": "/images/floor-1-1.png",
            "navList": [
                {
                    "url": "#",
                    "text": "热门"
                },
                {
                    "url": "#",
                    "text": "大家电"
                },
                {
                    "url": "#",
                    "text": "生活电器"
                },
                {
                    "url": "#",
                    "text": "厨房电器"
                },
                {
                    "url": "#",
                    "text": "应季电器"
                },
                {
                    "url": "#",
                    "text": "空气/净水"
                },
                {
                    "url": "#",
                    "text": "高端电器"
                }
            ],
            "carouselList": [
                {
                    "id": "0011",
                    "imgUrl": "/images/floor-1-b01.png"
                },
                {
                    "id": "0012",
                    "imgUrl": "/images/floor-1-b02.png"
                },
                {
                    "id": "0013",
                    "imgUrl": "/images/floor-1-b03.png"
                }
            ],
            "recommendList": [
                "/images/floor-1-2.png",
                "/images/floor-1-3.png",
                "/images/floor-1-5.png",
                "/images/floor-1-6.png"
            ],
            "bigImg": "/images/floor-1-4.png"
        },
        {
            "id": "002",
            "name": "手机通讯",
            "keywords": [
                "节能补贴2",
                "4K电视2",
                "空气净化器2",
                "IH电饭煲2",
                "滚筒洗衣机2",
                "电热水器2"
            ],
            "imgUrl": "/images/floor-1-1.png",
            "navList": [
                {
                    "url": "#",
                    "text": "热门2"
                },
                {
                    "url": "#",
                    "text": "大家电2"
                },
                {
                    "url": "#",
                    "text": "生活电器2"
                },
                {
                    "url": "#",
                    "text": "厨房电器2"
                },
                {
                    "url": "#",
                    "text": "应季电器2"
                },
                {
                    "url": "#",
                    "text": "空气/净水2"
                },
                {
                    "url": "#",
                    "text": "高端电器2"
                }
            ],
            "carouselList": [
                {
                    "id": "0011",
                    "imgUrl": "/images/floor-1-b01.png"
                },
                {
                    "id": "0012",
                    "imgUrl": "/images/floor-1-b02.png"
                },
                {
                    "id": "0013",
                    "imgUrl": "/images/floor-1-b03.png"
                }
            ],
            "recommendList": [
                "/images/floor-1-2.png",
                "/images/floor-1-3.png",
                "/images/floor-1-5.png",
                "/images/floor-1-6.png"
            ],
            "bigImg": "/images/floor-1-4.png"
        }
    ]
}